{
  "backend/main.mo": "Motoko canister managing user profiles, rewards tasks, submissions, points, and withdrawals with admin/user authorization. Provides CRUD-like operations for tasks and profile handling with access control.",
  "feature_evidence.json": "Feature evidence report linking a specific landing page text-change feature to its files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind-based global styles defining light/dark theme variables and applying base layout tokens.",
  "frontend/index.html": "Main HTML entry with PWA metadata, icons, and root mount point for the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, colors, icons, and display behavior for installation.",
  "frontend/public/sw.js": "Service worker implementing simple cache-first offline support with versioned cache handling.",
  "frontend/src/App.tsx": "Main React app controlling authentication flow, view routing, and profile setup gating.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI card displaying an access denied message for unauthorized users.",
  "frontend/src/components/AdminGuard.tsx": "Wrapper component that checks user role and renders admin content or an access denied screen.",
  "frontend/src/components/AdminScreen.tsx": "Admin dashboard for creating tasks and reviewing submissions and withdrawal requests.",
  "frontend/src/components/AppLayout.tsx": "Shared layout component providing navbar, main content container, and footer across views.",
  "frontend/src/components/LandingScreen.tsx": "Landing page component showing app intro, feature highlights, and login button using Internet Identity.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button handling Internet Identity authentication state and query cache resets.",
  "frontend/src/components/NavBar.tsx": "Responsive navigation bar showing views based on auth state and role, with mobile menu and login button.",
  "frontend/src/components/PointsBalanceCard.tsx": "Card displaying the user's points balance with loading and error states.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting new users for their name and saving it via a profile mutation.",
  "frontend/src/components/TasksScreen.tsx": "Screen listing tasks, showing submission statuses, and allowing users to submit task completions.",
  "frontend/src/components/WalletScreen.tsx": "Wallet view for requesting withdrawals and viewing request history with balance validation.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing the backend actor based on identity and invalidating related queries on change.",
  "frontend/src/hooks/useAdminQueries.ts": "Provides React Query hooks for admin actions like creating tasks, reviewing submissions, and handling withdrawal requests, mostly using placeholder queries where backend methods are missing.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for auth state, login flow, and identity persistence using AuthClient.",
  "frontend/src/hooks/useRewardsQueries.ts": "Defines React Query hooks for user profiles, roles, tasks, submissions, point balance, and withdrawal requests using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and custom theme variables for light and dark modes, plus global layout and mobile optimizations.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters and sessionStorage-backed values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, layout, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Metadata describing the project’s state, features, versions, and notes."
}